[
  {
    "year": 2021,
    "measureType": "hb",
    "measureNumber": 124,
    "date":  "Sat Apr 18 2022 00:23:54 GMT-1000 (Hawaii-Aleutian Standard Time)",
    "chair": "Chairs Rhoads and Dela Cruz",
    "viceChair": "Keohokalole and Keith-Agaran",
    "type": "Organization",
    "name": "DOE",
    "position":  "Support",
    "method":  "",
    "body":  "The Department of Transportation (DOT) strongly supports H.B. 1055 which authorizes\nthe DOT director to acquire real property in the name of the State of Hawai‘i for roads\nand streets, without review or approval by the board of land and natural resources. The\nlegislation will also recommend that the DOT be granted jurisdiction immediately upon\nacquisition of such real property, thereby eliminating the necessity of an executive order\nto transfer jurisdiction of the property from the Department of Land and Natural\nResources to the DOT and reduce the amount of time to acquire the real property.",
    "comment": "",
    "status": "Processor",
    "docName": "124_DOE"
  },
  {
    "year": 2021,
    "measureType": "hb",
    "measureNumber": 124,
    "date":  "Sat Apr 18 2022 00:23:54 GMT-1000 (Hawaii-Aleutian Standard Time)",
    "chair": "Chairs Rhoads and Dela Cruz",
    "viceChair": "Keohokalole and Keith-Agaran",
    "type": "Organization",
    "name": "DOE",
    "position":  "Support",
    "method":  "",
    "body":  "The Department has concerns about the unintended consequences that may\nresult from section 2 of H.D. 1. Section 2 creates an exception where the Public Utilities\nCommission (Commission) can approve the utility cost recovery of a generating or\nstorage unit that uses fossil fuels, at any time, as long as the utility also requests the\nestablishment of a stranded cost recovery mechanism that encourages the accelerated\nretirement of the fossil fuel generation plant. The Department is concerned that section\n2 will allow the Commission to consider fossil fueled solutions in 2040, for example, as\nlong as accelerated cost recovery occurs within five years to allow for early retirement.\nThe Department believes that the renewable portfolio standards, once corrected to\nDAVID Y. IGE\nGOVERNOR\nJOSH GREEN\nLT. GOVERNOR\nCATHERINE P. AWAKUNI COLÓN\nDIRECTOR\nJO ANN M. UCHIDA TAKEUCHI\nDEPUTY DIRECTOR\nTestimony of DCCA\nH.B. 111, H.D. 1\nPage 2 of 2\neliminate the sales-versus-generation loophole, will set clear guidelines for the\nCommission to ensure that reliance on fossil fuels is eliminated by 2045.",
    "comment": "",
    "status": "Writer",
    "docName": "501_DOE_RoughDraft"
  },
  {
    "year": 2021,
    "measureType": "hb",
    "measureNumber": 133,
    "date":  "Sat Apr 18 2022 00:23:54 GMT-1000 (Hawaii-Aleutian Standard Time)",
    "chair": "Chairs Rhoads and Dela Cruz",
    "viceChair": "Keohokalole and Keith-Agaran",
    "type": "Organization",
    "name": "DOE",
    "position":  "Oppose",
    "method":  "",
    "body":  "The Department of Hawaiian Home Lands (DHHL) submits comments on this bill\nthat amends the Hawaiian Homes Commission Act (HHCA) to (1) require appraisals of\nimprovements to identify the replacement cost or the leasehold market value; (2) grant\nauthority to DHHL to authorize second position loans on homestead leases by approved\nlenders; (3) require DHHL to develop and implement a loan servicing manual, subject to\ncommission approval, to standardize loan loss mitigation policies, procedures, and\nmethods; and to (4) clarify that DHHL shall not cancel a lease solely based on a loan\ndefault or delinquency unless all loan loss mitigation procedures are exhausted\npursuant to the loan services manual.",
    "comment": "",
    "status": "",
    "docName": "1124_DOE"
  },
  {
    "year": 2022,
    "measureType": "hb",
    "measureNumber": 137,
    "date":  "Sat Apr 18 2022 00:23:54 GMT-1000 (Hawaii-Aleutian Standard Time)",
    "chair": "Chairs Rhoads and Dela Cruz",
    "viceChair": "Keohokalole and Keith-Agaran",
    "type": "Organization",
    "name": "DOE",
    "position":  "Support",
    "method":  "",
    "body":  "House Bill 1588, HD1 establishes the resilient Hawaii revolving loan fund\nunder the Hawaii emergency management agency to make low- or no-interest\nloans to the counties and nonprofit organizations to conduct hazard mitigation\nand resiliency projects, using funds anticipated to be available under the\nfederal Safeguarding Tomorrow through Ongoing Risk Mitigation Act;\nestablishes positions; appropriates funds.\nAs major natural disasters become more prevalent, it becomes more important\nfor the State to leverage as many federal funding opportunities as possible to\nmitigate against and prepare for their impacts.",
    "comment": "",
    "status": "Processor",
    "docName": "137_DOE"
  }
]
